Autodesk.Revit.DB.Structure.FabricArea.RemoveFabricReinforcementSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.FabricArea)
Deletes the specified FabricArea, and converts its FabricSheet elements
to equivalent Single Fabric Sheet elements.
doc:
The document.
system:
An FabricArea Reinforcement element in the document.
Returns:
The ids of the newly created Single Fabric Sheet elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document doc does not contain the element system
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricArea.GetCurveElementIds
Retrieves the identifiers of the set of curves forming the boundary of the Fabric Area.
Remarks:
Each ElementId in the collection is an Id of an Element of type CurveElem.
Returns:
A collection of ElementIds of FabricAreaCurve elements.
Since:
2013

Autodesk.Revit.DB.Structure.FabricArea.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a FabricArea based on a host boundary.
aDoc:
The document.
hostElement:
The element that will host the FabricArea. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
majorDirection:
A vector to define the major direction of the FabricArea.
fabricAreaTypeId:
The id of the FabricAreaType.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created FabricArea.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document aDoc does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
fabricAreaTypeId should refer to an FabricAreaType element.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricArea.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a FabricArea from an array of curves.
aDoc:
The document.
hostElement:
The element that will host the FabricArea. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveLoops:
An array of curves that will define the outline of the FabricArea.
This includes curves defining openings in the interior of the area.
majorDirection:
A vector to define the major direction of the FabricArea.
majorDirectionOrigin:
An origin point of the major direction line
fabricAreaTypeId:
The id of the FabricAreaType.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created FabricArea.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all curveLoops in curveLoops are closed and continuous.
-or-
Not all curveLoops in curveLoops are in the same plane.
-or-
curveLoops should only contain lines or arcs.
-or-
The document aDoc does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
fabricAreaTypeId should refer to an FabricAreaType element.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricArea.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a FabricArea from an array of curves.
aDoc:
The document.
hostElement:
The element that will host the FabricArea. The host can be either a Structural Floor or Structural Wall.
curveLoops:
An array of curves that will define the outline of the FabricArea.
This includes curves defining openings in the interior of the area.
majorDirection:
A vector to define the major direction of the FabricArea.
majorDirectionOrigin:
An origin point of the major direction line
Returns:
The newly created FabricArea.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all curveLoops in curveLoops are closed and continuous.
-or-
Not all curveLoops in curveLoops are in the same plane.
-or-
curveLoops should only contain lines or arcs.
-or-
The document aDoc does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014